import { CommonModule } from '@angular/common';
import { Component, signal } from '@angular/core';
import { RouterOutlet } from '@angular/router';

@Component({
  selector: 'app-root',
  imports: [CommonModule],
  templateUrl: './app.html',
  styleUrl: './app.scss'
})
export class App {
  protected readonly title = signal('hbdGift');

   cards = [
    { text: 'შენი ხელები ცივია,ჩემი კი ცეცხლივით იწვის,რა ბრმახარ ნასტენკა.', category: 'love'  },
    { text: 'რად გაჩნდა იგი?იქნებ იმიტომ რომ შენს სიახლოვეს ყოფილიყო,თუნდაც წამიერად.', category: 'love'  },
    { text: 'ბატონი ბრძანდებით ნასტენკა!ოცი წელი რო მყვარებოდით,ახლანდელზე ძლიერად მაინც არ მეყვარებოდით!', category: 'love'  },
    { text: 'ზოგის მადლიერი ხანდახან თუნდაც იმიტომ ვართ,რომ ჩვენ გვერდით არიან,მე კი იმითაც მადლიერი ვარ,რომ შემხვდით და მთელი ცხოვრება მემახსოვრებით...', category: 'love'  },
    { text: 'როცა გიყვარს,წყენა გულში აღარ გრჩება.', category: 'love'  },
    { text: 'რამდენჯერ გითქვამს აღარ გიყვარვარო. შენ გინდა, რომ მთელი ცხოვრება ჯვარის წერის პირველ დღეს ჰგავდეს. ასე არაა ძვირფასო. თუ დამიჯერებ, მე დღეს შენი ნაოჭები უფრო მიყვარს, ვიდრე შენი სახე ოცი წლის წინათ, მაგრამ ცხოვრება ისე გღლის, რომ ყოველთვისს აღტაცებულ მიჯნურად ვეღარ გამოიყურები კაცი... შენთან ყოფნა ბედნიერებაა, მაგრამ ძნელიც არის. შენ ხომ ყველა ადამიანს შესვამ ხოლმე სადღაც ზევით, უსაშველო სიმაღლეზე და არც კითხულობ არის თუ არა იქ მისი ადგილი', category: 'love'  },
    { text: 'სიყვარული არ არის ლაქა, რომელიც შეიძლება ჩამოირეცხო. ის არის სუნთქვა, რომლის გარეშეც ცხოვრება შეუძლებელია.', category: 'love'  },
    { text: 'მადლობა ღმერთს,რომ ამ ქვეყნად სიყვარული მოიგონა.', category: 'love'  },
    { text: 'სიყვარული ის არის,როდესაც შენ გიყვარს ის და სამაგიეროდ არაფერს არ მოელი მისგან.', category: 'love'  },
    { text: 'მთელ სამყაროს დეხქვეშ დაგიდებდი,ეს სამყარო თავად შენ რომ არ ყოფილიყავი', category: 'love'  },

  
    { text: 'რა საშინელებაა მარტო,სრულიად მარტო დარჩენა,როცა წარსულში გულდასაწყვეტიც არაფერი გრჩება...იმიტომ,რომ რაც დავკარგე,მხოლოდ არარა,მხოლოდ სულელური ფუჭი ოცნება იყო!', category: 'sad'  },
    { text: 'როცა თვითონ ხარ უბედური,სხვის უბდეურებას მაშინ უფრო გრძნობ,მაშინ უფრო გულისხმიერი ხდები...', category: 'sad'  },
    { text: 'რაც უფრო ბნელია ღამე,მით უფრო კაშკაშაა ვარსკვლავები,რაც უფრო მარტოსულია სული,მით უფრო ახლოსაა ღმერთი', category: 'sad'  },
    { text: 'ზოგჯერ ადამიანს ისე ეშინია მარტოობის რომ პირველი თბილი სიტყვაც კი საკმარისია,სულით მისდევდეს მას,ვინც ეს სიტყვა უთხრა.და მაშინ,როცა გული პირველად გათბება,იფიქრებ,რომ შენთვისაც არსებობდეს ბედნიერება -თუნდაც წამიერად,თუნდაც მხოლოდ ერთ ღამეში.', category: 'sad'  },
    { text: 'სიცოცხლე იგუდება მიზნის გარეშე', category: 'sad'  },
    { text: 'პირველ ნაბიჯს არავინ დგამს,რადგანაც ორივე თვლის რომ ეს არა ორმხრივია', category: 'sad'  },
    { text: 'პირველ ნაბიჯს არავინ დგამს,რადგანაც ორივე თვლის რომ ეს არა ორმხრივია', category: 'sad'  },
    { text: 'ყველაფერი დროებითია,კარგიც და ცუდიც', category: 'sad'  },
    { text: 'ნუ დაანავიანებთ თქვენს მეხსიერებას წყენებით,რადგანაც იქ მშვენიერი მომენტებისთვის შეიძლება ადგილი აღარ დაგრჩეთ', category: 'sad'  },
    { text: 'დიდებს არც კი გაეგებათ,რომ ყველაზე რთულ საკითხშიც კი,ბავშვმა შეიძლება უაღრესად მნიშვნელოვანი რჩევა მისცეთ', category: 'sad'  },


    { text: 'ერთადერთი ადამიანი, ვისთანაც უნდა შეადარო თავი, არის შენი წარსული მე. და ერთადერთი, ვინც უკეთესი უნდა იყოს, არის ის, ვინც ახლა ხარ.', category: 'tired' },
    { text: 'არ აქვს მნიშვნელობა, რამდენად მაღალია მთა — მზე ყოველთვის ამოდის.', category: 'tired' },
    { text: 'სიცოცხლე იმად არ ღირს მისი გულისთვის კაცი შიშს მონად გაუხდე.', category: 'tired' },
    { text: 'ბუნების ფუნდამეტური კანონია,რომ განვითარებისთვის საკუთარ საზღვრებს გაცდე,რაც მტკინვეულია,რათა ძალა მოიპოვო', category: 'tired' },
    { text: 'ტკივილი + გააზრება = პროგრესს', category: 'tired' },
    { text: 'წარტმატებული ადამიანები - ესენი არიან უბრალო ადამიანები წარმატებული ჩვევებით.', category: 'tired' },
    { text: 'წარმატების გასაღები იმაშია,რომ გონება მიმართო იმისკენ,რაც გსურს და არა იმისკენ,რისიც გეშინია', category: 'tired' },
    { text: 'ადამიანები,რომლებსაც აქვთ მკაფიო,წერილობითი მიზნები,ბევრად მეტს აღწევენ მოკლე დროში,ვიდრე ის ადამიანები რომლებსაც ეს არ აქვთ', category: 'tired' },
    { text: 'არ გაჩერდე,როცა დაიღლები.გაჩერდი,როცა მორჩები.', category: 'tired' },
    { text: 'შენ იმ საშიშროების წინაშე დგახარ,რომ იცხოვრო იმდენად კომფორტული და რბილი ცხოვრებით,რომ ისე მოკვდე,ვერასდროს გააცნობიერო შენი ნამდვილი პოტენციალი', category: 'tired' },

     
    { text: 'ადამიანს ფრთები მხოლოდ იმიტომ არ აქვს,რომ ფიქრით ბევრად შორს შეუძლია გაფრენა', category: 'happy' },
    { text: 'ბედნიერება არ არის ის, რომ ყველაფერი გქონდეს, რაც გინდა, არამედ ის, რომ გიყვარდეს ყველაფერი, რაც უკვე გაქვს.', category: 'happy' },
    { text: 'ყველაფერს აქვს თავის მიზეზი.', category: 'happy' },
    { text: 'შენი ცხოვრების ბედნიერება დამოკიდებულია შენი აზრების ხარისხზე.', category: 'happy' },
    { text: 'ყოველთვის იყავი ბედნიერი სხვა ადამიანებით,შენი დროც აუცილებლად მოვა', category: 'happy' },
    { text: 'იყავი ბედნიერი — არა იმიტომ, რომ ყველაფერი კარგადაა, არამედ იმიტომ, რომ ყველაფერში ხედავ კარგს.', category: 'happy' },
    { text: 'იზრუნე იმაზე, რომ შენი ცხოვრება სავსე იყოს ფრაზებით — ‘ვერ ვიჯერებ, რომ ეს გავაკეთე’, და არა — ‘უნდა გამეკეთებინა', category: 'happy' },
    { text: 'რაც უფრო მადლიერი ვარ, მით უფრო მეტ სილამაზეს ვხედავ.', category: 'happy' },
    { text: 'მე ადამიანს მთაზე ასვლაში დავეხმარე — და ვერ მივხვდი, რომ თავადაც მწვერვალს მივაღწიე', category: 'happy' },
    { text: 'იმ წამს, როცა წარსულთან ბრძოლას შეწყვეტ, მომავალი იწყებს გაბრწყინებას.', category: 'happy' },
    { text: 'თუ ეს შენს ბედნიერებას იწვევს, არ არის საჭირო, რომ სხვებისთვის რაიმე მნიშვნელობა ჰქონდეს.', category: 'happy' },
   
  ];

  currentCard: string = '';

  showRandomCard(category: string) {
    const filtered = this.cards.filter(c => c.category === category);
    if (filtered.length > 0) {
      const randomIndex = Math.floor(Math.random() * filtered.length);
      this.currentCard = filtered[randomIndex].text;
    }
  }
}
